# 1. Load JSON file

In [11]:
import json

with open('data_3.json') as f:
  data = json.load(f)
print(data)

[{'user': {'id': 1, 'name': 'agus', 'email': 'agus@example.com'}, 'txs': [{'id': 1, 'tx_date': '2020-01-01', 'tx_amount': 10, 'tx_type': 'buy'}, {'id': 3, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'buy'}, {'id': 5, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'sell'}]}, {'user': {'id': 2, 'name': 'asep', 'email': 'asep@example.com'}, 'txs': [{'id': 2, 'tx_date': '2020-01-01', 'tx_amount': 10, 'tx_type': 'sell'}, {'id': 4, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'sell'}, {'id': 6, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'buy'}]}]

# 2. Convert JSON into pandas dataframe

In [23]:
dataset = pd.json_normalize(data, record_path='txs',meta='user')
dataset

,id,tx_date,tx_amount,tx_type,user
0,1,2020-01-01,10,buy,"{'id': 1, 'name': 'agus', 'email': 'agus@examp..."
1,3,2020-02-01,10,buy,"{'id': 1, 'name': 'agus', 'email': 'agus@examp..."
2,5,2020-03-01,20,sell,"{'id': 1, 'name': 'agus', 'email': 'agus@examp..."
3,2,2020-01-01,10,sell,"{'id': 2, 'name': 'asep', 'email': 'asep@examp..."
4,4,2020-02-01,10,sell,"{'id': 2, 'name': 'asep', 'email': 'asep@examp..."
5,6,2020-03-01,20,buy,"{'id': 2, 'name': 'asep', 'email': 'asep@examp..."

# 3. Convert to 3 required CSV files

## 1. CSV_1

In [75]:
#u_data = dataset.drop(['tx_date, tx_amount, tx_type, user'], axis = 1)
t_data = dataset.drop(['tx_date', 'tx_amount', 'tx_type', 'user'], axis = 1)
t_data.columns = ['tx_id']
t_data

   tx_id
0      1
1      3
2      5
3      2
4      4
5      6

In [76]:
u_data = dataset['user'].apply(pd.Series)
u_data = u_data.drop(['name', 'email'], axis = 1)
u_data.columns = ['user_id']
u_data

   user_id
0        1
1        1
2        1
3        2
4        2
5        2

In [77]:
concantenate = pd.concat([u_data, t_data], axis = 1)
concantenate

   user_id  tx_id
0        1      1
1        1      3
2        1      5
3        2      2
4        2      4
5        2      6

In [78]:
concantenate.to_csv('CSV_1.csv', index = False)

## 2. CSV_2

In [42]:
user_data = pd.json_normalize(data)
user_data = user_data[['user.id', 'user.name', 'user.email']]
user_data

   user.id user.name        user.email
0        1      agus  agus@example.com
1        2      asep  asep@example.com

In [43]:
user_data.columns = ['id', 'name', 'email']

In [46]:
user_data.to_csv('CSV_2.csv', index = False)

# 3. CSV_3

In [50]:
trx_data = dataset[['id', 'tx_date', 'tx_amount', 'tx_type']]
trx_data = trx_data.sort_values('id')
trx_data

   id     tx_date  tx_amount tx_type
0   1  2020-01-01         10     buy
3   2  2020-01-01         10    sell
1   3  2020-02-01         10     buy
4   4  2020-02-01         10    sell
2   5  2020-03-01         20    sell
5   6  2020-03-01         20     buy

In [51]:
trx_data.to_csv('CSV_3.csv', index = False)